test/cassettes/tax_area_multiple.yml

---
http_interactions:
- request:
    method: post
    uri: "{VERTEX_SOAP_API}LookupTaxAreas70"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:vertexinc:o-series:tps:7:0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><urn:VertexEnvelope><Login><TrustedId>{VERTEX_TRUSTED_ID}</TrustedId></Login><TaxAreaRequest><TaxAreaLookup><PostalAddress><StreetAddress1>126487
        N Bridge Rd</StreetAddress1><City>Aberdeen</City><MainDivision>SD</MainDivision><PostalCode>57401</PostalCode></PostalAddress></TaxAreaLookup></TaxAreaRequest></urn:VertexEnvelope></soapenv:Body></soapenv:Envelope>
    headers:
      Soapaction:
      - '"VertexEnvelope"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '627'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: ''
    headers:
      Date:
      - Tue, 29 Jan 2019 19:13:23 GMT
      Content-Type:
      - text/xml;charset=UTF-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      Soapaction:
      - '""'
      Server:
      - ''
    body:
      encoding: ASCII-8BIT
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header></soapenv:Header><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:7:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId></TrustedId>
        </Login>
        <TaxAreaResponse><TaxAreaResult taxAreaId="420130010" confidenceIndicator="85"><Jurisdiction jurisdictionLevel="COUNTRY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="1">UNITED STATES</Jurisdiction>
        <Jurisdiction jurisdictionLevel="STATE" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="34374">SOUTH DAKOTA</Jurisdiction>
        <Jurisdiction jurisdictionLevel="COUNTY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="34413">BROWN</Jurisdiction>
        <Jurisdiction jurisdictionLevel="CITY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="34414">ABERDEEN</Jurisdiction>
        <Jurisdiction jurisdictionLevel="DISTRICT" effectiveDate="2014-10-01" expirationDate="9999-12-31" jurisdictionId="99543"><![CDATA[ABERDEEN BUSINESS IMPROVEMENT DISTRICT NO. 2]]></Jurisdiction>
        <PostalAddress><StreetAddress1>126487 N Bridge Rd</StreetAddress1>
        <City>Aberdeen</City>
        <MainDivision>SD</MainDivision>
        <SubDivision>Brown</SubDivision>
        <PostalCode>57401-8688</PostalCode>
        <Country>USA</Country>
        </PostalAddress>
        <Status lookupResult="NORMAL"></Status>
        </TaxAreaResult>
        <TaxAreaResult taxAreaId="420130000" confidenceIndicator="15"><Jurisdiction jurisdictionLevel="COUNTRY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="1">UNITED STATES</Jurisdiction>
        <Jurisdiction jurisdictionLevel="STATE" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="34374">SOUTH DAKOTA</Jurisdiction>
        <Jurisdiction jurisdictionLevel="COUNTY" effectiveDate="1900-01-01" expirationDate="9999-12-31" jurisdictionId="34413">BROWN</Jurisdiction>
        <PostalAddress><StreetAddress1>126487 N Bridge Rd</StreetAddress1>
        <City>Aberdeen</City>
        <MainDivision>SD</MainDivision>
        <SubDivision>Brown</SubDivision>
        <PostalCode>57401-8688</PostalCode>
        <Country>USA</Country>
        </PostalAddress>
        <Status lookupResult="NORMAL"></Status>
        </TaxAreaResult>
        </TaxAreaResponse>
        <ApplicationData><ResponseTimeMS>56</ResponseTimeMS>
        </ApplicationData>
        </VertexEnvelope></soapenv:Body></soapenv:Envelope>
    http_version: 
  recorded_at: Tue, 29 Jan 2019 19:13:23 GMT
recorded_with: VCR 4.0.0
